AssaousOussama/PIC18F2550_PLC/PIC18F2550_BootloaderCode/PicUsb.X/PIC18F2550_bootloader.c
//Descriptor Types
#define DEVICE                    0x01
#define CONFIGURATION             0x02
#define STRING                    0x03
#define INTERFACE                 0x04
#define ENDPOINT                  0x05
#define DEVICE_QUALIFIER          0x06
#define OTHER_SPEED_CONFIGURATION 0x07
#define INTERFACE_POWER           0x08



char BDOSTATOUT    __at(0x0400);
char BDOCNTOUT     __at(0x0401);
char BDOADRLOUT    __at(0x0402);
char BDOADRHOUT    __at(0x0403);
 
char bmRequestType __at(0x0500);
char bRequest      __at(0x0501);
char wValue[2]     __at(0x0502);
char wIndex[2]     __at(0x0504);
//char wLength[2]    __at(0x0506);
int wLength    __at(0x0506);
  

char BDOSTATIN     __at(0x0404);
char BDOCNTIN      __at(0x0405);
char BDOADRLIN     __at(0x0406);
char BDOADRHIN     __at(0x0407);

char IN0DATAOF [8] __at(0x0508);
char switsh [100]    __at(0x0500);
char bwitsh [100]    __at(0x0540);
 

int cp = 0;
char i;
int progcount=0;
char Request;
char wLengthDev = 0x00;
int DeviceCun ;
char DeviceCun1 = 0x08;

int ConfigCun;
char ConfigCun1 = 0x1A;


char stringcun ;

char stringval;
int INnum ;
char TokenId;



int DevMax = 18;
int ConfMax = 67;
int stringMax1 = 4;
int stringMax2 = 52;
int stringMax3 = 52;


char send[100]     __at(0x0508);
char send1    __at(0x0509);
char send2    __at(0x050A);
char send3    __at(0x050B);
char send4    __at(0x050C);
char send5    __at(0x050D);
char send6    __at(0x050E);
char send7    __at(0x050F);
char DevBiCun;

int DevByte;

int f = 0;



char EpromRead(char);
int resetdiv(void);
int reqhand();

void program();

void outset(int);
void inset(int,int);

int main()

{
    
    
 //UCON = 0x00;
    for(i =0 ;i<192;i++)
    {
      IN0DATAOF [i]  = EpromRead(i);  
    }
    TRISB =0x00;
    TRISC =0xff;
    PORTB = 0x00;
  
    UIE = 0x00;
    UIR = 0x00;
    
    UEP0 = 0x16;
    
    UCFG = 0x14;//UCFG = 0x10;
 //   if(RC0)
//    {
     UCON = 0x08;
     
   // }
    // RB0=1;
  //  while(SE0) {}
    
    while(1)//while(RC0)
    {
       
        if(UERRIF)   UEIR = 0x00;
        else if(SOFIF) SOFIF = 0;
             else if(IDLEIF) { IDLEIF = 0; SUSPND = 1;}
                  else if(ACTVIF)  {ACTVIF =0; SUSPND =0;}
                       else if(STALLIF) STALLIF = 0;
                            else if(URSTIF) { 
                                             resetdiv();                                          
                                            }
                                        else if(TRNIF) 
                                        {
                                            if(DIR)
                                            {//The last transaction was an IN token
                                                TRNIF = 0 ;
                                                switch(Request)
                                                {
                                                    case DEVICE:
                                                                {      
                                                                     reqhand();                                 
                                                                }
                                                    break;
                                                    case CONFIGURATION:
                                                                 {
                                                                     reqhand();                                                                    
                                                                 }
                                                    break;
                                                    case STRING:
                                                                {
                                                                     switch(stringval)
                                                                     {
                                                                         case 0x00:
                                                                         {
                                                                             outset(0x08);
                                                                       /*  BDOCNTOUT = 0x08;
                                                                         BDOADRLOUT = 0x00;
                                                                         BDOADRHOUT =0x05;
                                             
                                                                         BDOSTATOUT =0x80;  */
                                                                         }
                                                                         break;
                                                                         case 0x01:
                                                                         {
                                                                             reqhand();                                                                    
                                                                         }
                                                                         break;
                                                                         case 0x02:
                                                                         {                                                                             
                                                                             reqhand();                                                                                                                                                                                                                                   
                                                                         }
                                                                         break;
                                                                             
                                                                     }
                                                                }
                                                    break;
                                                    //case INTERFACE:
                                                    //break;
                                                    //case ENDPOINT:
                                                    //break;
                                                    //case DEVICE_QUALIFIER:
                                                    //break;
                                                    //case OTHER_SPEED_CONFIGURATION:
                                                    //break;
                                                    //case INTERFACE_POWER:
                                                    //break;
                                                }
                                             
