AssaousOussama/PIC18F2550_PLC/PIC18F2550_BootloaderCode/PicUsb.X/PIC18F2550_bootloader.c
                                            }
                                            else
                                            {//The last transaction was an OUT or SETUP token
                                                RB0 = 1 ;
                                                TRNIF = 0 ;
                                                PKTDIS = 0;
                                                
                                                TokenId = BDOSTATOUT & 0x3c;
                                                
                                                if(TokenId == 0x34)
                                                {   
                                                  switch(bRequest)
                                                  {
                                                        case GET_STATUS:
                                                        {
                                                            outset(0x08);
                                                       /* BDOCNTOUT = 0x08;
                                                        BDOADRLOUT = 0x00;
                                                        BDOADRHOUT =0x05;
                                             
                                                        BDOSTATOUT =0x80;*/
                                                        }
                                                        break;
                                                        //case CLEAR_FEATURE:
                                                        //break;
                                                        //case SET_FEATURE:
                                                        //break;
                                                        case SET_ADDRESS:
                                                        {
                                                            inset(0x00,0x08);
                                                           /* BDOCNTIN  = 0x00 ;
                                                            BDOADRLIN = 0x08 ;
                                                            BDOADRHIN = 0x05 ;
                                                                      
                                                            BDOSTATIN = 0x80 ;*/
                                                        }
                                                        break;
                                                        case GET_DESCRIPTOR:
                                                         {
                                                            switch(wValue[1])
                                                             {
                                                                 case DEVICE:
                                                                 {     
                                                                     
                                                                      Request = DEVICE ;
                                                                      
                                                                     DeviceCun = wLength;
                                                                     DeviceCun1 = 0x08;
                                                                     if(DeviceCun >=  DevMax )
                                                                     {
                                                                       DevByte = DevMax;  
                                                                     }
                                                                     else { DevByte = DeviceCun ;}
                                                                                                                                        
                                                                     inset(0x08,0x08);
                                                                    /*  BDOCNTIN  = 0x08 ;
                                                                      BDOADRLIN = 0x08 ;
                                                                      BDOADRHIN = 0x05 ;
                                                                      
                                                                      BDOSTATIN = 0x80 ;*/
                                                                                                                                                                                                             
                                                                 }
                                                                 break;
                                                                 case CONFIGURATION:
                                                                 {
                                                                     Request = CONFIGURATION ;
                                                                     DeviceCun1 = 0x1A;
                                                                    DeviceCun = wLength;
                                                                     
                                                                     if(DeviceCun >=  ConfMax )
                                                                     {
                                                                       DevByte = ConfMax;  
                                                                     }
                                                                     else { DevByte = DeviceCun ;}
                                                                     inset(0x08,0x1A);
                                                                     /* BDOCNTIN  = 0x08 ;
                                                                      BDOADRLIN = 0x1A ;
                                                                      BDOADRHIN = 0x05 ;
                                                                      
