AssaousOussama/PIC18F2550_PLC/PIC18F2550_BootloaderCode/PicUsb.X/PIC18F2550_bootloader.c
                                                                      BDOSTATIN = 0x80 ;*/
                                                                 }
                                                                 break;
                                                                 case STRING:
                                                                 {
                                                                    Request = STRING ;
                                                                     
                                                                     //ConfigCun = wLength;
                                                                     stringval = wValue[0];
                                                                     switch(wValue[0])
                                                                     {
                                                                         case 0x00:
                                                                         {  
                                                                             DeviceCun1 = 0x5D;
                                                                             DeviceCun = wLength;
                                                                     
                                                                            if(DeviceCun >=  stringMax1 )
                                                                              {
                                                                               DevByte = stringMax1;  
                                                                              }
                                                                              else { DevByte = DeviceCun ;}
                                                                             
                                                                           //  stringcun = 0x5D ;
                                                                             inset(0x04,0x5D);
                                                                         /*  BDOCNTIN  = 0x04 ;
                                                                           BDOADRLIN = 0x5D ;
                                                                           BDOADRHIN = 0x05 ;
                                                                        
                                                                           BDOSTATIN = 0x80 ;  */
                                                                         }
                                                                         break;
                                                                         case 0x01:
                                                                         {
                                                                              DeviceCun1 = 0x61;
                                                                             DeviceCun = wLength;
                                                                     
                                                                            if(DeviceCun >=  stringMax2 )
                                                                              {
                                                                               DevByte = stringMax2;  
                                                                              }
                                                                              else { DevByte = DeviceCun ;}
                                                                            // stringcun = 0x61 ;
                                                                             inset(0x08,0x61);
                                                                           /*  BDOCNTIN  = 0x08 ;
                                                                             BDOADRLIN = 0x61 ;
                                                                             BDOADRHIN = 0x05 ;
                                                                      
                                                                             BDOSTATIN = 0x80 ;  */
                                                                         }
                                                                         break;
                                                                         case 0x02:
                                                                         {
                                                                              DeviceCun1 = 0x95;
                                                                             DeviceCun = wLength;
                                                                     
                                                                            if(DeviceCun >=  stringMax3 )
                                                                              {
                                                                               DevByte = stringMax3;  
                                                                              }
                                                                              else { DevByte = DeviceCun ;}
                                                                            // stringcun = 0x95 ;
                                                                             inset(0x08,0x95);
                                                                           /*  BDOCNTIN  = 0x08 ;
                                                                             BDOADRLIN = 0x95 ;
                                                                             BDOADRHIN = 0x05 ;
                                                                      
                                                                             BDOSTATIN = 0x80 ; */
                                                                         }
                                                                         break;
                                                                         
