AssaousOussama/PIC18F2550_PLC/PIC18F2550_BootloaderCode/PicUsb.X/PIC18F2550_bootloader.c
                                                                     }
                                                                      
                                                                 }
                                                                 break;
                                                                 //case INTERFACE:
                                                                 //break;
                                                                 //case ENDPOINT:
                                                                 //break;
                                                                 //case DEVICE_QUALIFIER:
                                                                 //break;
                                                                 //case OTHER_SPEED_CONFIGURATION:
                                                                 //break;
                                                                 //case INTERFACE_POWER:
                                                                 //break;
                                                             }
                                                         }
                                                        break;
                                                       /* case SET_DESCRIPTOR:
                                                         { 
                                                             switch(wValue[0])
                                                             {
                                                                 //case DEVICE:
                                                                 //break;
                                                                 //case CONFIGURATION:
                                                                 //break;
                                                                 //case STRING:
                                                                 //break;
                                                                 //case INTERFACE:
                                                                 //break;
                                                                 //case ENDPOINT:
                                                                 //break;
                                                                 //case DEVICE_QUALIFIER:
                                                                 //break;
                                                                 //case OTHER_SPEED_CONFIGURATION:
                                                                 //break;
                                                                 //case INTERFACE_POWER:
                                                                 //break;
                                                             }
                                                            
                                                         }
                                                        break; */
                                                        //case GET_CONFIGURATION:
                                                        //break;
                                                        case SET_CONFIGURATION:
                                                        {
                                                            inset(0x00,0x08);
                                                           /* BDOCNTIN  = 0x00 ;
                                                            BDOADRLIN = 0x08 ;
                                                            BDOADRHIN = 0x05 ;
                                                                      
                                                            BDOSTATIN = 0x80 ;*/
                                                        }
                                                        break;
                                                        //case GET_INTERFACE:
                                                        //break;
                                                        case SET_INTERFACE:
                                                        {
                                                            inset(0x00,0x08);
                                                           /* BDOCNTIN  = 0x00 ;
                                                            BDOADRLIN = 0x08 ;
                                                            BDOADRHIN = 0x05 ;
                                                                      
                                                            BDOSTATIN = 0x80 ;*/
                                                        }
                                                        break;
                                                        //case SYNCH_FRAME:
                                                        //break;
                                                        
                                                 }
                                            }else if(TokenId == 0x04)
                                            {  
                                               
                                                
                                                if(switsh [0] == 'O' && switsh [1] == 'N') //(bmRequestType == 0x61) 
                                                  {
                                                                                                                                                    
                                                   /*  TBLPTR = 0x7FE0;//0x000A;
                                                    for(int rt=0 ;rt < 32 ; rt++)
                                                     {
                                                      __asm("TBLRD*+");
                                                      send[rt] =  TABLAT;
                                                     }
                                                                                                                                                         
                                                    
