AssaousOussama/PIC18F2550_PLC/PIC18F2550_BootloaderCode/PicUsb.X/PIC18F2550_bootloader.c
                                                     inset(0x20,0x08); */
                                                   /* BDOCNTIN  = 0x20;//0x10; //0x08 ;
                                                    BDOADRLIN = 0x08 ;
                                                    BDOADRHIN = 0x05 ;
                                                                      
                                                    BDOSTATIN = 0x80;*/
                                                                                                 
                                                  }
                                                    else if(switsh [0] == 'O' && switsh [1] == 'F')//bmRequestType == 0x62 
                                                    {RB0= 0;
                                                    
                                                    
                                                    switsh [0] = 0xFF;  
                                                    switsh [1] = 0xFF;  
                                                    switsh [2] = 0xFF;  
                                                    switsh [3] = 0xFF;
                                                              
                                                    outset(0x08);
                                                      /* BDOCNTOUT = 0x08;//0x08;
                                                       BDOADRLOUT = 0x00;
                                                       BDOADRHOUT =0x05;
                                             
                                                       BDOSTATOUT =0x80; */ 
                                                       UCON = 0x00;
                                                
                                                    __asm("GOTO 0x7FFC");
                                                    }else if(switsh [0] == 'P' && switsh [1] == 'R' && switsh [2] == 'O' && switsh [3] == 'G')
                                                           {                                                                                                                                                                                                     
                                                             program();                                                                                                                                                                                                                     
                                                           }
                                                    else if(switsh [0] == 'E' && switsh [1] == 'R' && switsh [2] == 'E' && switsh [3] == 'S')
                                                    {
                                                        TBLPTR = 0x800;
                                                        
                                                       // TBLPTR = 0x7fc0;
                                                        while (TBLPTR < 0x7FFF)
                                                        {
                                                        EEPGD = 1;
                                                        CFGS = 0;
                                                        WREN = 1;
                                                        FREE = 1 ;
                                                        GIE = 0;
                                                        EECON2 = 0x55;
                                                        EECON2 = 0x0AA;
                                                        WR = 1;
                                                        GIE = 1; 
                                                        FREE = 0 ;
                                                        TBLPTR = TBLPTR + 0x40 ;
                                                        }
                                                        
                                                    }
                                                
                                                outset(0xc8);
                                                      /* BDOCNTOUT = 0xC8;//0x64;//0x08;
                                                       BDOADRLOUT = 0x00;
                                                       BDOADRHOUT =0x05;
                                             
                                                       BDOSTATOUT =0x80; */
                                                    
                                            }
                                                                                             
                                            }   
                                        }
                                                                                                                                                      
        
    }
    
   // __asm("GOTO 0x4");
     UCON = 0x00;
    __asm("GOTO 0x7FFC");
     
}

///********************************************///
///     FUNCTION : char EpromRead(char addres) ///
///     OUTPUT : read from the EEPROM          ///
///********************************************///
char EpromRead(char addres)
{
    EEADR = addres;
    EEPGD = 0;
    CFGS = 0;
    RD = 1;
   return EEDATA ;
    
}

///******************************************///
///        FUNCTION : void resetdiv()        ///
///        OUTPUT : reset the USB interface  ///
///******************************************///
int resetdiv()
{    
     URSTIF = 0; 
     TRNIF = 0; 
     TRNIF = 0;
     TRNIF = 0; 
     TRNIF = 0;
     UEP0 = 0x00;
     UEP1 = 0x00;
     UEP2 = 0x00;
     UEP3 = 0x00;
     UEP4 = 0x00;
     UEP5 = 0x00;
     UEP6 = 0x00;
     UEP7 = 0x00;
     UEP8 = 0x00;
     UEP9 = 0x00;
     UEP10 = 0x00;
     UEP11 = 0x00;
     UEP12 = 0x00; 
     UEP13 = 0x00;
     UEP14 = 0x00;
     UEP15 = 0x00;
                                             
     UEP0 = 0x16;
     DeviceCun1 = 0x08;
     ConfigCun1 = 0x1A;
     BDOCNTOUT = 0x08;
     BDOADRLOUT = 0x00;
     BDOADRHOUT =0x05;
                                             
     BDOSTATOUT =0x80;
     return 0;
}
///******************************************///

///*********************************************///
///          FUNCTION : int reqhand()           ///
///         OUTPUT : handl the request          ///
///*********************************************///
int reqhand()
{
    DevByte -= 8;
    if(DevByte > 0)
    {   
        DeviceCun1 += 0x08;
        if(DevByte >= 8)  {DevBiCun = 0x08;}
        else {  DevBiCun = DevByte ; }
        
