AssaousOussama/PIC18F2550_PLC/PIC18F2550_BootloaderCode/PicUsb.X/PIC18F2550_bootloader.c
        inset(DevBiCun,DeviceCun1);
       /* BDOCNTIN  = DevBiCun ;
        BDOADRLIN = DeviceCun1 ;
        BDOADRHIN = 0x05 ;
        BDOSTATIN = 0x80 ; */
        
    }
    else
    {
       outset(0x08);
       /* BDOCNTOUT = 0x08;
        BDOADRLOUT = 0x00;
        BDOADRHOUT =0x05;
        
        BDOSTATOUT =0x80;*/
        
    }
    return 0;
    
}
///*********************************************///


///************************************************///
///        FUNCTION : void program()               ///
///       OUTPUT : read data from the USB ram then ///
///  program it to the flash memory program        ///
///                                                ///
///************************************************///
void  program()
{
    int op=0;                                                                                                     
                  
    cp = 6;
    //TBLPTR = 0x00;
    
    TBLPTRL = switsh [5];
    TBLPTRH = switsh [4];
    TBLPTRU = 0x00;
     //------------------------1------------------------------
    for(op=0 ; op<31; op++)
    {
                                                      
     TABLAT = switsh [cp];
     __asm("TBLWT*+");
       cp++;
    }         
    TABLAT = switsh [cp];
     __asm("TBLWT");                                                                                                                                                       
    cp++;
    EEPGD = 1;
    CFGS = 0;
    WREN = 1 ;
    GIE = 0 ;
    EECON2 = 0x55;
    EECON2 = 0x0AA;
    WR = 1;
    GIE = 1 ;
    WREN = 0 ;  
                                                      
    TBLPTR++;
                                        
}
///************************************************///

///*************************************************///
///*************************************************///
void outset(int outbitcon)
{
     BDOCNTOUT = outbitcon;//0x08;
     BDOADRLOUT = 0x00;
     BDOADRHOUT =0x05;
                                             
     BDOSTATOUT =0x80;  
}

///*************************************************///

///*************************************************///
///*************************************************///
void inset(int inbitcon,int inlowadr)
{
     BDOCNTIN  = inbitcon;//0x10; //0x08 ;
     BDOADRLIN = inlowadr ;
     BDOADRHIN = 0x05 ;
                                                                      
     BDOSTATIN = 0x80;
}
///*************************************************///
